WikKam/STM32F4-MP3-PLAYER/Src/main.c
    /*Configure GPIO pin : PA0 */
    GPIO_InitStruct.Pin = GPIO_PIN_0;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    /*Configure GPIO pin : BOOT1_Pin */
    GPIO_InitStruct.Pin = BOOT1_Pin;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(BOOT1_GPIO_Port, &GPIO_InitStruct);

    /*Configure GPIO pin : CLK_IN_Pin */
    GPIO_InitStruct.Pin = CLK_IN_Pin;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    GPIO_InitStruct.Alternate = GPIO_AF5_SPI2;
    HAL_GPIO_Init(CLK_IN_GPIO_Port, &GPIO_InitStruct);

    /*Configure GPIO pins : LD4_Pin LD3_Pin LD5_Pin LD6_Pin
                             Audio_RST_Pin */
    GPIO_InitStruct.Pin = LD4_Pin | LD3_Pin | LD5_Pin | LD6_Pin
                          | Audio_RST_Pin;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

    /*Configure GPIO pin : OTG_FS_OverCurrent_Pin */
    GPIO_InitStruct.Pin = OTG_FS_OverCurrent_Pin;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(OTG_FS_OverCurrent_GPIO_Port, &GPIO_InitStruct);

    /*Configure GPIO pin : MEMS_INT2_Pin */
    GPIO_InitStruct.Pin = MEMS_INT2_Pin;
    GPIO_InitStruct.Mode = GPIO_MODE_EVT_RISING;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(MEMS_INT2_GPIO_Port, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */

extern ApplicationTypeDef Appli_state;
extern USBH_HandleTypeDef hUsbHostHS;
#define AUDIO_OUT_BUFFER_SIZE 8192
#define MAX_SONG_NAME_SIZE 100
#define MAX_NUMBER_SONGS 50
#define FW_PATH "0:/"
enum {
    BUFFER_OFFSET_NONE = 0,
    BUFFER_OFFSET_HALF,
    BUFFER_OFFSET_FULL,
};
static uint8_t buf_offs = BUFFER_OFFSET_NONE;
static uint32_t fpos = 0;
typedef enum {
    FINISHED = 0,
    PLAYING,
    PAUSED,
    NEXT,
    PREVIOUS
} PLAYER_STATE;
static PLAYER_STATE player_state1 = FINISHED;
int volume = 70;
FIL file;
FRESULT res;
char play_buffer[AUDIO_OUT_BUFFER_SIZE];
unsigned char input_buffer[AUDIO_OUT_BUFFER_SIZE];
unsigned char *input_buffer_pointer;
short spare_buffer[
        AUDIO_OUT_BUFFER_SIZE / 2]; // short ma 16 bitów a char 8, wiec pamięciowo taka sama wielkość jak play_buffer
short *spare_buffer_pointer;
int spare_buffer_offset = 0;
int bytes_in_input_buffer = 0;
MP3FrameInfo mp3_frame_info;
HMP3Decoder decoder;
int title_offset = 0;
char songs[MAX_NUMBER_SONGS][MAX_SONG_NAME_SIZE];
int songs_number = 0;

void decode(int play_offset) {
    uint32_t bytes_read = 0;
    //zczytujemy dane z pliku do momentu zapełnienia input_buffera
    if (f_read(&file, input_buffer_pointer, AUDIO_OUT_BUFFER_SIZE - bytes_in_input_buffer, (void *) &bytes_read) !=
        FR_OK) {
        BSP_AUDIO_OUT_Stop(CODEC_PDWN_SW);
        xprintf("file reading error\n");
    }
    //aktualizujemy ilość bajtów w input_bufferze
    bytes_in_input_buffer += bytes_read;
    //przesuwamy wskaźnik na początek
    input_buffer_pointer = input_buffer;
    //dopóki offset jest mniejszy niż połowa długości
    while (spare_buffer_offset < AUDIO_OUT_BUFFER_SIZE / 4) {
        int offset = MP3FindSyncWord((unsigned char *) input_buffer_pointer, bytes_in_input_buffer);
        if (offset == -1) {
            xprintf("Offset is -1 :(");
        }
        //Przesuwamy wskaźnik -> szukamy początku ramki
        bytes_in_input_buffer -= (offset);
        input_buffer_pointer += (offset);
        //dekodujemy ramkę (dane w input_buffer) do spare_buffer
        int is_error = MP3Decode(decoder, (unsigned char **) &input_buffer_pointer, (int *) &bytes_in_input_buffer,
                                 spare_buffer_pointer, 0);
        if (is_error) {
            xprintf("Error while decoding %d.\n", is_error);
            break;
        }
        //aktualizujemy ilość przetworzonych bajtów
        MP3GetLastFrameInfo(decoder, &mp3_frame_info);
        spare_buffer_offset += mp3_frame_info.outputSamps;
        spare_buffer_pointer = spare_buffer + spare_buffer_offset;

    }
    //przesuwamy dane w input_buffer na początek
    memcpy(input_buffer, input_buffer_pointer, bytes_in_input_buffer);
    //aktualizujemy położenie input_pointera tak, aby wskazywał tam, gdzie możemy już umiescić dane
    input_buffer_pointer = input_buffer + bytes_in_input_buffer;

    //wrzucamy dane ze spare_buffera do którego zbieraliśmy dekodowane mp3 do play_buffera odpowiedzialnego za granie
    memcpy(play_buffer + play_offset, spare_buffer, AUDIO_OUT_BUFFER_SIZE / 2);
    //po wrzuceniu danych do celu aktualizujemy spare_buffer, wysłaliśmy do play_buffera audio_out_buffer_size / 4 danych z powodu różnicy formatów, to co zostało to wrzucamy na początek
    memcpy(spare_buffer, &spare_buffer[AUDIO_OUT_BUFFER_SIZE / 4],
           (spare_buffer_offset - AUDIO_OUT_BUFFER_SIZE / 4) * 2);
    spare_buffer_offset -= AUDIO_OUT_BUFFER_SIZE / 4;
    spare_buffer_pointer = spare_buffer + spare_buffer_offset;
    buf_offs = BUFFER_OFFSET_NONE;
}

void find_mp3_files() {
    FRESULT fr;     /* Return value */
    DIR dj;         /* Directory object */
    FILINFO fno;    /* File information */

    fr = f_findfirst(&dj, &fno, FW_PATH, "*.MP3"); /* Start to search for photo files */
    while (fr == FR_OK && fno.fname[0]) {         /* Repeat while an item is found */
        // omit filenames with . and _ at the beginning
        if (fno.fname[0] != '.' && fno.fname[0] != '_') {
            strcpy(songs[songs_number++], fno.fname); //copy mp3 filename into songs array
        }
        fr = f_findnext(&dj, &fno);               /* Search for next item */
    }
    f_closedir(&dj);
}

void end_song() {
    BSP_AUDIO_OUT_Stop(CODEC_PDWN_SW);
    f_close(&file);
    xprintf("End of song\n");
    player_state1 = FINISHED;
    spare_buffer_offset = 0;
    bytes_in_input_buffer = 0;
    buf_offs = BUFFER_OFFSET_NONE;
}

int volume_up() {
    if (player_state1 == PLAYING) {
        if (BSP_AUDIO_OUT_SetVolume(volume < 71 ? volume += 10 : volume) != AUDIO_OK) {
            xprintf("ERROR: Failed to set audio volume\n");
            return -1;
        }
        xprintf("w: volume up. Current volume: %d\n", volume);
    } else {
        xprintf("cannot resume in this state :( \n");
    }
    return 0;
}

int volume_down() {
    if (player_state1 == PLAYING) {
        if (BSP_AUDIO_OUT_SetVolume(volume > 9 ? volume -= 10 : volume) != AUDIO_OK) {
            xprintf("ERROR: Failed to set audio volume\n");
            return -1;
        }
        xprintf("s: volume down. Current volume: %d\n", volume);
    } else {
        xprintf("cannot resume in this state :( \n");
    }
    return 0;
}

