WikKam/STM32F4-MP3-PLAYER/Src/main.c
void resume() {
    if (player_state1 == PAUSED) {
        xprintf("resuming...\n");
        player_state1 = PLAYING;
        BSP_AUDIO_OUT_SetVolume(volume);
        BSP_AUDIO_OUT_Resume();
    } else {
        xprintf("cannot resume in this state :( \n");
    }
}

void pause() {
    if (player_state1 == PLAYING) {
        xprintf("pausing...\n");
        player_state1 = PAUSED;
        BSP_AUDIO_OUT_SetVolume(0);
        BSP_AUDIO_OUT_Pause();
    } else {
        xprintf("cannot pause in this state :( \n");
    }
}

int shift_song(char in) {
    if (player_state1 == PLAYING) {
        end_song();
        if(in == 'n') {
            xprintf("playing next song...\n");
            player_state1 = NEXT;
            return EXIT_SUCCESS;
        } else {
            xprintf("playing previous song...\n");
            player_state1 = PREVIOUS;
            return EXIT_SUCCESS;
        }
    } else {
        xprintf("cannot resume in this state :( \n");
        return EXIT_FAILURE;
    }
}

void play_mp3(char *filename) {
    title_offset = 0;
    res = f_open(&file, filename, FA_READ);
    if (res == FR_OK) {
        xprintf("%s open OK. Playing song\n", filename);
    } else {
        xprintf("mp3 file open ERROR, res = %d\n", res);
        while (1);
    }
    spare_buffer_pointer = spare_buffer;
    input_buffer_pointer = input_buffer;
    BSP_AUDIO_OUT_Play((uint16_t * ) & play_buffer[0], AUDIO_OUT_BUFFER_SIZE);
    decode(0);
    decode(AUDIO_OUT_BUFFER_SIZE / 2);
    player_state1 = PLAYING;
    fpos = 0;
    buf_offs = BUFFER_OFFSET_NONE;

    for (;;) {
        char in = debug_inkey();
        if (in == 'w') {
            volume_up();
        } else if (in == 's') {
            volume_down();
        } else if (in == 'p') {
            pause();
        } else if (in == 'r') {
            resume();
        } else if (in == 'n' || in == 'q') {
            if(shift_song(in) == 0) return;
        }

        if (player_state1 == PLAYING) {
            if (buf_offs == BUFFER_OFFSET_HALF) {
                decode(0);
            }
            if (buf_offs == BUFFER_OFFSET_FULL) {
                decode(AUDIO_OUT_BUFFER_SIZE / 2);
            }
            if (bytes_in_input_buffer == 0) {
                end_song();
                return;
            }
        }
    }
}

void play_songs() {
    int i = 0;
    for (;;) {
        i = i < 0 ? songs_number - 1 : i % songs_number;
        play_mp3(songs[i]);
        if(player_state1 == NEXT || player_state1 == FINISHED) i++;
        if(player_state1 == PREVIOUS) i--;
        printf("state: %d; i: %d", player_state1, i);
    }
}

/**
  * @brief  Manages the DMA Half Transfer complete interrupt.
  * @param  None
  * @retval None
  */
void BSP_AUDIO_OUT_HalfTransfer_CallBack(void) {
    buf_offs = BUFFER_OFFSET_HALF;
}

/**
* @brief  Calculates the remaining file size and new position of the pointer.
* @param  None
* @retval None
*/
void BSP_AUDIO_OUT_TransferComplete_CallBack(void) {
    buf_offs = BUFFER_OFFSET_FULL;
    BSP_AUDIO_OUT_ChangeBuffer((uint16_t * ) & play_buffer[0], AUDIO_OUT_BUFFER_SIZE / 2);
}

/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used 
  * @retval None
  */
void StartDefaultTask(void const *argument) {
    /* init code for USB_HOST */
    MX_USB_HOST_Init();

    /* init code for FATFS */
    MX_FATFS_Init();

    /* USER CODE BEGIN 5 */

    HAL_GPIO_WritePin(OTG_FS_PowerSwitchOn_GPIO_Port, OTG_FS_PowerSwitchOn_Pin, GPIO_PIN_RESET);

    vTaskDelay(1000);

    xprintf("waiting for USB mass storage\n");

    do {
        xprintf(".");
        vTaskDelay(250);
    } while (Appli_state != APPLICATION_READY);

    decoder = MP3InitDecoder();

    if (BSP_AUDIO_OUT_Init(OUTPUT_DEVICE_AUTO, volume, 44100) == 0) {
        xprintf("audio init OK\n");
    } else {
        xprintf("audio init ERROR\n");
    }

    /* Infinite loop */
    for (;;) {
        find_mp3_files();
        play_songs();
        vTaskDelay(1);
    }
    /* USER CODE END 5 */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM7 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim) {
    /* USER CODE BEGIN Callback 0 */

    /* USER CODE END Callback 0 */
    if (htim->Instance == TIM7) {
        HAL_IncTick();
    }
    /* USER CODE BEGIN Callback 1 */

    /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  file: The file name as string.
  * @param  line: The line in file as a number.
  * @retval None
  */
void _Error_Handler(char *file, int line) {
    /* USER CODE BEGIN Error_Handler_Debug */
    /* User can add his own implementation to report the HAL error return state */
    while (1) {
    }
    /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
